{
  "id": "contract_00377243-0cdb-46c8-915f-9b0bbe32f855",
  "summary": "343rd Training Squadron seeks eight 125-capacity bleacher systems, small business set-aside, delivery only.",
  "createdAt": "2025-07-03 08:30:31",
  "naicsId": "337127",
  "postedDate": "2025-07-02 00:00:00",
  "title": "Bleacher Seating Systems",
  "solicitationNumber": "FA301625Q0050",
  "agencyName": "DEPT OF THE AIR FORCE",
  "agencyCode": "5700",
  "agencyOrgName": "DEPT OF DEFENSE",
  "type": "combined",
  "typeOfSetAside": "SBA",
  "typeOfSetAsideDescription": "Total Small Business Set-Aside (FAR 19.5)",
  "description": "<p>The 343rd Training Squadron (TRS), Joint Base San Antonio (JBSA) Lackland and Camp Bullis, TX has a requirement for eight<br />\\n(8) Bleacher Seating Systems to accommodate 125 personnel (accommodations for 123 personnel is acceptable). This<br />\\nrequirement will be performed in accordance with (IAW) the Statement of Work (SOW). No installation is required. The NAICS<br />\\nCode is 337127 - Bleacher Seating Manufacturing. The PSC is 7195 - Miscellaneous Furniture and Fixtures. The small business<br />\\nadministration (SBA) size standard is 500 employees. NAICS Code 337127 was terminated from the Non-Manufacturer Waiver<br />\\n(NMR) List on 8 June 2022, and as such, the NMR will apply. See SOW, dated 7 January 2025, for additional details.&nbsp;</p>\\n\\n<p>In addition to solicitation FA301625Q0050 attached, the following are also attachment(s).<br />\\nAttachment 1 - SOW, dated 7 January 2025<br />\\nAttachment 2 - Contractor Release of Financial Information and<br />\\nAttachment 3 - Financial Information Questionnaire Form.</p>",
  "active": true,
  "organizationType": "OFFICE",
  "officeZipcode": "78236-5286",
  "officeCity": "JBSA LACKLAND",
  "officeCountryCode": "USA",
  "officeState": "TX",
  "placeOfPerformanceStreetAddress": null,
  "placeOfPerformanceStreetAddress2": null,
  "placeOfPerformanceCityCode": "0",
  "placeOfPerformanceCityName": "DWG",
  "placeOfPerformanceCityStateCode": "TX",
  "placeOfPerformanceCityStateName": "Texas",
  "placeOfPerformanceCountryCode": "USA",
  "placeOfPerformanceCountryName": "UNITED STATES",
  "placeOfPerformanceZipcode": "78236",
  "pointOfContact": [
    {
      "fax": "",
      "type": "primary",
      "email": "parie.reynolds@us.af.mil",
      "phone": "2103178332",
      "title": null,
      "fullName": "Parie D Reynolds"
    },
    {
      "fax": "",
      "type": "secondary",
      "email": "lance.watters.1@us.af.mil",
      "phone": "2106711763",
      "title": null,
      "fullName": "Lance Watters"
    }
  ],
  "sourceUrl": "https://sam.gov/opp/5a202416ba04406fbb70924114a416d4/view",
  "providerUrl": "https://sam.gov/opp/5a202416ba04406fbb70924114a416d4/view",
  "providerType": "sam",
  "sourceId": "5a202416ba04406fbb70924114a416d4",
  "deadlineDate": "2025-07-21 21:00:00",
  "rawData": null,
  "overview": "The 343rd Training Squadron at Joint Base San Antonio Lackland and Camp Bullis, Texas is seeking to procure eight bleacher seating systems, each capable of accommodating at least 123 personnel, with an ideal capacity of 125. This procurement falls under NAICS code 337127 for Bleacher Seating Manufacturing and is classified as miscellaneous furniture and fixtures under PSC 7195. No installation is required; the scope is limited to the manufacture and delivery of the bleacher units as defined in the Statement of Work dated January 7, 2025. The solicitation, identified by number FA301625Q0050, requires compliance with the Non-Manufacturer Rule (NMR) due to the recent removal of this NAICS code from the NMR waiver list as of June 8, 2022.\\n\\nThis contract opportunity is a total small business set-aside under FAR 19.5, with a response deadline of July 21, 2025. The solicitation packet includes the SOW, a contractor release of financial information, and a financial information questionnaire. Interested vendors must ensure their workforce does not exceed 500 employees, adhering to SBA size standards. The primary and secondary points of contact are Parie D Reynolds and Lance Watters, respectively. Performance will take place within the state of Texas, and additional resources and detailed requirements can be accessed via the provided online links.",
  "importedByEntityId": null,
  "sizeLow": 0,
  "sizeHigh": 0,
  "responseType": "rfq",
  "responseTypeConfidence": 95,
  "responseTypeReasoning": "The solicitation is for a straightforward procurement of eight Bleacher Seating Systems, which aligns with RFQ characteristics focused on obtaining price quotes for standardized goods. There are no complex evaluation criteria or detailed technical proposals required, indicating a simpler submission process typical of RFQs.",
  "awarded": false,
  "sourceType": "sam",
  "updatedAt": "2025-07-03 15:25:08",
  "naicsCode": "337127",
  "naicsName": "Institutional Furniture Manufacturing "
}
